Repository: libguestfs/virt-v2v
Catalog: po/*.po
Languages: pt_br

source: this guest has no non-removable disks
pt_br: este convidado não tem discos não-removíveis

source: this output module doesn't support copying more than %d disks
pt_br: este módulo de saída não suporta copiar mais de %d discos

source: timezone '%s' does not exist, use a location like 'Europe/London'
pt_br: o fuso horário '%s' não existe, use um local como 'Europa/Londres'

source: timezone could not be set for this type of guest
pt_br: o fuso horário não pôde ser definido para este tipo de convidado

source: unable to parse line from manifest file: %S
pt_br: não foi possível analisar a linha do arquivo de manifesto: %S

source: unexpected end of file while reading /dev/urandom
pt_br: fim de arquivo inesperado ao ler /dev/urandom

source: unexpected output from the %s command
pt_br: saída inesperada do comando %s

source: unhandled checksum type ‘%s’
pt_br: tipo de some de verificação não tratada ‘%s’

source: unknown --root option: %s
pt_br: opção --root desconhecida: %s

source: unknown -i option: %s
pt_br: opção -i desconhecida: %s

source: unknown -o option: %s
pt_br: opção -o desconhecida: %s

source: unknown -oa option: %s
pt_br: opção -oa desconhecida: %s

source: unknown <checksum> method='%s'
pt_br: method=‘%s’ de <checksum> desconhecido

source: unknown Config:firmware value %s (expected "bios" or "efi")
pt_br: valor de Config:firmware desconhecido %s (esperava "bios" ou "efi")

source: unknown Windows 10 variant: %s (%s)
pt_br: variante de Windows 10 desconhecida: %s (%s)

source: unknown block driver ‘--block-driver %s’
pt_br: driver de bloco desconhecido ‘--block-driver %s’

source: unknown firmware value '%s', assuming BIOS
pt_br: valor de firmware desconhecido '%s', presumindo BIOS

source: unknown guest operating system: %s %s %d.%d %s (%s)
pt_br: sistema operacional convidado desconhecido: %s %s %d.%d %s (%s)

source: unknown input transport ‘-it %s’
pt_br: transporte de entrada desconhecido ‘-it %s’

source: unknown sound device '%s' ignored
pt_br: desconhecido de som desconhecido '%s' ignorado

source: unknown sound model %s ignored
pt_br: modelo de som desconhecido %s ignorado

source: unsupported compression in OVF: %s
pt_br: compactação não suportada por OVF: %s

source: vcenter: <vmware:datacenterpath> was not found in the XML. You need to upgrade to libvirt ≥ 1.2.20.
pt_br: vcenter: <vmware:datacenterpath> não foi encontrado no XML. Você precisa atualizar para libvirt ≥ 1.2.20.

source: vcenter: URL not found: %s
pt_br: vcenter: URL não encontrado: %s

source: vcenter: incorrect username or password
pt_br: vcenter: nome de usuário e senha incorretos

source: vcenter: incorrect username or password. You might need to specify the username in the URI like this: [vpx|esx|..]://USERNAME@[etc]
pt_br: vcenter: nome de usuário ou senha incorretos. Você pode precisar especificar o nome de usuário na URI como este: [vpx|esx|..]://USERNAME@[etc]

source: vcenter: invalid response from server: %s
pt_br: vcenter: resposta inválida do servidor: %s

source: vcenter: no status code in output of ‘curl’ command.
pt_br: vcenter: nenhum código de status na saída do comando ‘curl’.

source: vdsm: invalid -os parameter does not contain a valid UUID: %s
pt_br: vdsm: um parâmetro -os inválido não contém não contém um UUID válido: %s

source: virt-v2v -oo server-id=<NAME|UUID> [os-*=...] Specify the name or UUID of the conversion appliance using virt-v2v ... -o openstack -oo server-id=<NAME|UUID> When virt-v2v runs it will attach the Cinder volumes to the conversion appliance, so this name or UUID must be the name of the virtual machine on OpenStack where virt-v2v is running. In addition, all usual OpenStack “os-*” parameters or “OS_*” environment variables can be used. Openstack “--os-*” parameters must be written as “virt-v2v -oo os-*”. For example: virt-v2v -oo os-username=<NAME> equivalent to openstack: --os-username=<NAME> or the environment variable: OS_USERNAME=<NAME> virt-v2v -oo os-project-name=<NAME> equivalent to openstack: --os-project-name=<NAME> or the environment variable: OS_PROJECT_NAME=<NAME> The os-* parameters and environment variables are optional.
pt_br: virt-v2v -oo server-id=<NAME|UUID> [os-*=...] Especifique o nome ou UUID do appliance de conversão usando virt-v2v ... -o openstack -oo server-id=<NAME|UUID> Quando virt-v2v é executado, ele irá conectar os volumes Cinder ao dispositivo de conversão, portanto, esse nome ou UUID deve ser o nome da máquina virtual no OpenStack onde o virt-v2v está em execução. Além disso, todos os usuais parâmetros “os-*” do OpenStack ou as variáveis de ambiente “OS_*” podem ser usados. Os parâmetros “--os-*” do Openstack devem ser escritos como “virt-v2v -oo os-*”. Por exemplo: virt-v2v -oo os-username=<NAME> equiavalente a openstack: --os-username=<NAME> ou a variável de ambiente: OS_USERNAME=<NAME> virt-v2v -oo os-project-name=<NAME> equiavalente a openstack: --os-project-name=<NAME> ou a variável de ambiente: OS_PROJECT_NAME=<NAME> Os parâmetros os-* e variáveis de ambiente são opcionais.

source: virt-v2v does not support local displays, so <graphics type='%s'> in the input libvirt XML was ignored
pt_br: o virt-v2v não suporta displays locais, então <graphics type='%s'> no XML libvirt de entrada foi ignorado

source: virt-v2v-in-place does not support remote libvirt URIs
pt_br: o virt-v2v-in-place não suporta URIs libvirt remotos

source: vmx URI path component looks incorrect
pt_br: o componente de caminho URI vmx parece incorreto

source: vmx URI remote server name omitted
pt_br: nome de servidor remoto de URI em vmx omitido

source: vmx URI start with ‘ssh://...’
pt_br: URI em vmx começa com ‘ssh://...’

source: vmx parser: cannot parse this line, ignoring: %s
pt_br: analisador de vmx: não é possível analisar esta linha, ignorando: %s

source: vmx parser: duplicate key '%s' ignored
pt_br: analisador de vmx: chave duplicada '%s' ignorada

source: wait for cinder volume status to change to "available"
pt_br: aguardando o status do volume cinder ser alterado para "available" (disponível)

source: waiting for cinder volume %s to attach to the conversion appliance
pt_br: aguardando pelo volume cinder %s ser anexado ao appliance de conversão

source: you must supply the --run parameter
pt_br: você deve fornecer o parâmetro --run

source: ‘-ic %s’ URL does not contain a host name field
pt_br: a URL ‘-ic %s’ não contém o campo de nome do host

source: ‘-io vddk-file=’ must be used exactly %d times
pt_br: ‘-io vddk-file=’ deve ser usado exatamente %d vezes

source: ‘-io vddk-libdir=%s’ does not point to a directory. See the virt-v2v-input-vmware(1) manual.
pt_br: ‘-io vddk-libdir=%s’ não aponta para um diretório. Veja o manual virt-v2v-input-vmware(1).

source: ‘-oo compressed’ is only allowed when the output format is a local qcow2-format file, i.e. ‘-of qcow2’
pt_br: ‘-oo compressed’ só é permitido quando o formato de saída é um arquivo qcow2-format local, isto é, ‘-of qcow2’

source: ‘openssl’ command not found: automatically detecting thumbprint is not possible, so you must use ‘-io vddk-thumbprint=XX:XX...’
pt_br: comando ‘openssl’ não encontrado: não é possível detectar automaticamente impressões digitais, então você deve usar ‘-io vddk-thumbprint=XX:XX...’

source: Try ‘%s --help’ or consult %s(1) for more information.
pt_br: Tente ‘%s --help’ ou consulte %s(1) para mais informações.

source: %s: ‘%s’ is not a numeric value.
pt_br: %s: ‘%s’ não é um valor numérico.

source: %s: %s: integer out of range
pt_br: %s: %s: inteiro fora do limite

source: %s: ‘%s’ is not allowed for -%c; allowed values are:
pt_br: %s: ‘%s’ não é permitido para -%c; valores permitidos são:

source: %s: ‘%s’ is not allowed for %s%s; allowed values are:
pt_br: %s: ‘%s’ não é permitido para %s%s; valores permitidos são:

source: Extra parameter on the command line: ‘%s’.
pt_br: Parâmetro extra na linha de comando: ‘%s’.

source: %s: line %d: error parsing configuration file: %s
pt_br: %s: linha %d: erro ao analisar o arquivo de configuração: %s

source: string size overflow
pt_br: estouro de tamanho da string

source: 'clevis_luks_unlock', needed for decrypting %s, is unavailable in this libguestfs version
pt_br: 'clevis_luks_unlock', necessário para descriptografar %s, está indisponível nesta versão do libguestfs

source: could not find key to open LUKS encrypted %s. Try using --key on the command line. Original error: %s (%d)
pt_br: não foi possível encontrar chave para abrir %s criptografado com LUKS. Tente usar --key na linha de comando. Erro original: %s (%d)

source: %s: no operating system was found on this disk If using guestfish ‘-i’ option, remove this option and instead use the commands ‘run’ followed by ‘list-filesystems’. You can then mount filesystems you want by hand using the ‘mount’ or ‘mount-ro’ command. If using guestmount ‘-i’, remove this option and choose the filesystem(s) you want to see by manually adding ‘-m’ option(s). Use ‘virt-filesystems’ to see what filesystems are available. If using other virt tools, this disk image won’t work with these tools. Use the guestfish equivalent commands (see the virt tool manual page).
pt_br: %s: nenhum sistema operacional foi encontrado neste disco Se estiver usando a opção '-i' do guestfish, remova-a e use os comandos 'run' seguido de 'list-filesystems'. Você poderá então montar os sistemas de arquivos desejados manualmente usando o comando 'mount' ou 'mount-ro'. Se estiver usando a opção '-i' do guestmount, remova-a e escolha os sistemas de arquivos que deseja visualizar adicionando manualmente a(s) opção(ões) '-m'. Use 'virt-filesystems' para ver quais sistemas de arquivos estão disponíveis. Se estiver usando outras ferramentas de virtualização, esta imagem de disco não funcionará com elas. Use os comandos equivalentes do guestfish (consulte a página man da ferramenta de virtualização).

source: %s: multi-boot operating systems are not supported If using guestfish ‘-i’ option, remove this option and instead use the commands ‘run’ followed by ‘list-filesystems’. You can then mount filesystems you want by hand using the ‘mount’ or ‘mount-ro’ command. If using guestmount ‘-i’, remove this option and choose the filesystem(s) you want to see by manually adding ‘-m’ option(s). Use ‘virt-filesystems’ to see what filesystems are available. If using other virt tools, multi-boot operating systems won’t work with these tools. Use the guestfish equivalent commands (see the virt tool manual page).
pt_br: %s: sem suporte a sistemas operacionais com multi-inicialização Se estiver usando a opção '-i' do guestfish, remova-a e use os comandos 'run' seguido de 'list-filesystems'. Você poderá então montar os sistemas de arquivos desejados manualmente usando o comando 'mount' ou 'mount-ro'. Se estiver usando a opção '-i' do guestmount, remova-a e escolha os sistemas de arquivos que deseja visualizar adicionando manualmente a(s) opção(ões) '-m'. Use 'virt-filesystems' para ver quais sistemas de arquivos estão disponíveis. Se estiver usando outras ferramentas de virtualização, sistemas operacionais com inicialização múltipla não funcionarão com essas ferramentas. Use os comandos equivalentes do guestfish (consulte a página do manual da ferramenta de virtualização).

source: %s: some filesystems could not be mounted (ignored)
pt_br: %s: alguns sistemas de arquivos não puderam ser montados (ignorado)

source: Operating system: %s
pt_br: Sistema operacional: %s

source: %s mounted on %s
pt_br: %s montado em %s

source: Enter key or passphrase ("%s"):
pt_br: Insira a chave ou senha ("%s"):

source: size_t overflow
pt_br: estouro de size_t

source: could not read key from user
pt_br: não foi possível ler a chave do usuário

source: %s: ‘%s’ could not be mounted.
pt_br: %s: ‘%s’ não pôde ser montado.

source: %s: Check mount(8) man page to ensure options ‘%s’ %s: are supported by the filesystem that is being mounted.
pt_br: %s: Consulte a página man mount(8) para garantir que as opções ‘%s’ %s: seja compatíveis com o sistema de arquivos que está sendo montado.

source: %s: Did you mean to mount one of these filesystems?
pt_br: %s: Você pretendia montar um desses sistemas de arquivos?

source: cannot determine the subvolume for %s: %s (%d)
pt_br: não foi possível determinar o subvolume de %s: %s (%d)

source: %s: --add: could not parse URI ‘%s’
pt_br: %s: --add: não foi possível analisar a URI ‘%s’

source: %s: %s: scheme of URI is NULL or empty
pt_br: %s: %s: esquema de URI é NULL ou vazia

source: %s: %s: cannot have both a server name and a socket query parameter
pt_br: %s: %s: não é possível ter simultaneamente um nome de servidor e um parâmetro de consulta de socket

source: %s exited successfully
pt_br: %s saiu com sucesso

source: %s exited with error status %d
pt_br: %s saiu com status de erro %d

source: %s killed by signal %d (%s)
pt_br: %s morto pelo sinal %d (%s)

source: %s stopped by signal %d (%s)
pt_br: %s parado pelo sinal %d (%s)

source: %s exited for an unknown reason (status %d)
pt_br: %s saiu por um motivo desconhecido (status %d)
