Repository: libguestfs/virt-v2v
Catalog: po/*.po
Languages: pt_br

source: %s Options:
pt_br: %s Opções:

source: %s (ignored)
pt_br: %s (ignorado)

source: %s did not return any output
pt_br: %s não retornou qualquer saída

source: %s does not exist in the guest
pt_br: %s não existe no convidado

source: %s does not exist or is not a directory. Most likely cause: Either the %s (%s) has not been attached to any Data Center, or the path %s is not an %s at all. You have to attach the %s to a Data Center using the oVirt user interface first. If you don’t know what the %s mount point should be then you can also find this out through the oVirt user interface.
pt_br: %s não existe ou não é um diretório. Causa mais provável: Ou %s (%s) não foi associado a nenhum Data Center, ou o caminho %s não é um %s. Você precisa associar %s a um Data Center usando a interface do usuário do oVirt primeiro. Se você não souber qual deve ser o ponto de montagem de %s, também poderá descobrir isso através da interface do usuário do oVirt.

source: %s ignored for non-Windows guest
pt_br: %s ignorado para convidados não-Windows

source: %s is not a regular file in the guest
pt_br: %s não é um arquivo regular no convidado

source: %s option used more than once on the command line
pt_br: Opção %s usada mais de uma vez na linha de comando

source: %s: Exiting on signal %s %!
pt_br: %s: Saindo com o sinal %s %!

source: %s: cannot open virtio-win ISO file: %s
pt_br: %s: não é possível abrir arquivo ISO virtio-win: %s

source: %s: command exited with an error
pt_br: %s: o comando foi encerrado com um erro

source: %s: convert a guest to use KVM virt-v2v -ic vpx://vcenter.example.com/Datacenter/esxi -os imported esx_guest virt-v2v -i libvirtxml guest-domain.xml -o local -os /var/tmp virt-v2v -i disk disk.img -o local -os /var/tmp There is a companion front-end called "virt-p2v" which comes as an ISO or CD image that can be booted on physical machines. A short summary of the options is given below. For detailed help please read the man page virt-v2v(1).
pt_br: %s: converte um convidado para usar KVM virt-v2v -ic vpx://vcenter.example.com/Datacenter/esxi -os imported esx_guest virt-v2v -i libvirtxml guest-domain.xml -o local -os /var/tmp virt-v2v -i disk disk.img -o local -os /var/tmp Existe uma interface complementar chamada "virt-p2v", que é fornecida como uma imagem ISO ou de CD que pode ser inicializada em máquinas físicas. Um breve resumo das opções é fornecido abaixo. Para obter ajuda detalhada, consulte a página man virt-v2v(1).

source: %s: convert a guest to use KVM in-place Note this program modifies the guest in-place with no backup. Normally you should use virt-v2v. virt-v2v-in-place -i libvirtxml guest-domain.xml virt-v2v-in-place -i disk disk.img A short summary of the options is given below. For detailed help please read the man page virt-v2v-in-place(1).
pt_br: %s: converte um convidado para usar KVM in-place Observe que este programa modifica o convidado in-place sem backup. Normalmente, você deve usar o virt-v2v. virt-v2v-in-place -i libvirtxml guest-domain.xml virt-v2v-in-place -i disk disk.img Um breve resumo das opções é fornecido abaixo. Para uma ajuda detalhada, consulte a página man virt-v2v-in-place(1).

source: %s: enter password for ‘%s’:
pt_br: %s: insira a senha de ‘%s’:

source: %s: error: %s
pt_br: %s: erro: %s

source: %s: estimate disk space needed before virt-v2v conversion virt-v2v-inspector -i disk disk.img [-O output.xml] A short summary of the options is given below. For detailed help please read the man page virt-v2v-inspector(1).
pt_br: %s: estima o espaço em disco necessário antes da conversão virt-v2v virt-v2v-inspector -i disk disk.img [-O output.xml] Um breve resumo das opções é fornecido abaixo. Para uma ajuda detalhada, consulte a página man virt-v2v-inspector(1).

source: %s: open the virt-v2v input and run a program on it virt-v2v-open -i disk disk.img --run 'virt-inspector --format=raw @@' A short summary of the options is given below. For detailed help please read the man page virt-v2v-open(1).
pt_br: %s: abre a entrada de virt-v2v e executa um programa nela virt-v2v-open -i disk disk.img --run 'virt-inspector --format=raw @@' Um breve resumo das opções é fornecido abaixo. Para uma ajuda detalhada, consulte a página man virt-v2v-open(1).

source: %s: operation timed out
pt_br: %s: a operação expirou

source: %s: unsupported file format Formats which we currently understand for '-i ova' are: tar (uncompressed, compress with gzip or xz), zip
pt_br: %s: formato de arquivo sem suporte Os formatos que atualmente reconhecemos para '-i ova' são: tar (descompactado, compactado com gzip ou xz), zip

source: %s: warning: %s
pt_br: %s: aviso: %s

source: --append-line: line must not contain newline characters. Use the --append-line option multiple times to add several lines.
pt_br: --append-line: a linha não deve conter caracteres de nova linha. Use a opção --append-line várias vezes para adicionar várias linhas.

source: --chown: could not parse numeric UID:GID from %s:%s
pt_br: --chown: não foi possível analisar o UID:GID numérico de %s:%s

source: --inject-blnsvr: blnsvr.exe not found in virtio-win source that you specified
pt_br: --inject-blnsvr: blnsvr.exe não encontrado na origem de virtio-win especificada

source: --inject-qemu-ga: QEMU Guest Agent MSI not found in virtio-win source that you specified
pt_br: --inject-qemu-ga: O MSI do QEMU Guest Agent não foi encontrado na origem de virtio-win especificada

source: --inject-virtio-win: virtio drivers were not found for this Windows version in the virtio-win source that you specified
pt_br: --inject-virtio-win: os drivers virtio não foram encontrados para esta versão do Windows na origem de virtio-win especificada

source: --mac ip prefix length field is out of range
pt_br: o campo de comprimento do prefixo IP da opção --mac está fora do intervalo

source: --parallel parameter must be >= 1
pt_br: o parâmetro --parallel deve ser >= 1

source: -i disk: expecting a disk image (filename) on the command line
pt_br: -i disk: esperava uma imagem de disco (nome de arquivo) na linha de comando

source: -i libvirt: expecting -ic parameter for Xen over SSH connection
pt_br: -i libvirt: esperava o parâmetro -ic para conexão Xen via SSH

source: -i libvirt: expecting -ic parameter for vcenter connection
pt_br: -i libvirt: esperava o parâmetro -ic para conexão com vcenter

source: -i libvirt: expecting -ic parameter to contain vcenter server name
pt_br: -i libvirt: esperava que o parâmetro -ic contenha o nome do servidor vcenter

source: -i libvirt: expecting -ip passwordfile parameter for vCenter connection
pt_br: -i libvirt: esperava o parâmetro -ip passwordfile para conexão com o vCenter

source: -i libvirt: expecting a libvirt guest name on the command line
pt_br: -i libvirt: esperava um nome de convidado libvirt na linha de comando

source: -i libvirtxml: expecting a libvirt XML filename on the command line
pt_br: -i libvirtxml: esperava um nome de arquivo XML do libvirt na linha de comando

source: -i ova: OVF references file ‘%s’ which was not found in the OVA archive
pt_br: -i ova: OVF faz referência ao arquivo ‘%s’, que não foi encontrado no arquivo OVA

source: -i ova: corrupt OVA: checksum of disk %s does not match manifest (actual = %s, expected = %s)
pt_br: -i ova: OVA corrompido: a soma de verificação do disco %s não corresponde ao manifesto (real = %s, esperado = %s)

source: -i ova: expecting an OVA file name on the command line
pt_br: -i ova: esperava um nome de arquivo OVA na linha de comando

source: -i ova: invalid OVA file: path ‘%s’ references a file outside the archive
pt_br: -i ova: arquivo OVA inválido: o caminho ‘%s’ faz referência a um arquivo fora do arquivo

source: -i vmx: cannot use -it vddk in this input mode
pt_br: -i vmx: não é possível usar -it vddk neste modo de entrada

source: -i vmx: expecting a VMX file or ssh:// URI
pt_br: -i vmx: esperava um arquivo VMX ou URI ssh://

source: -ip PASSWORD_FILE parameter ignored because 'user@' was not given in the URL
pt_br: parâmetro -ip PASSWORD_FILE foi ignorado porque 'user@' não foi fornecido na URL

source: -it vddk: ‘-io %s’ is not a valid input option
pt_br: -it vddk: ‘-io %s’ não é uma opção de entrada válida

source: -o %s: %s option cannot be used in this output mode
pt_br: -o %s: a opção %s não pode ser usada neste modo de saída

source: -o disk: output directory was not specified, use '-os /dir'
pt_br: -o disk: diretório de saída não foi especificado, use '-os /dir'

source: -o disk: unknown output option ‘-oo %s’
pt_br: -o disk: opção de saída desconhecida ‘-oo %s’

source: -o kubevirt: output directory was not specified, use '-os /dir'
pt_br: -o kubevirt: o diretório de saída não foi especificado, use '-os /dir'

source: -o kubevirt: the guest name must contain only lowercase alphanumeric characters, '-' or '.', and must start and end with an alphanumeric character. Rerun virt-v2v with the '-on name' option to rename it.
pt_br: -o kubevirt: o nome do convidado deve conter apenas caracteres alfanuméricos minúsculos, '-' or '.' e deve iniciar e terminar com um caractere alfanumérico. Execute novamente virt-v2v com a opção '-on name' para renomeá-la.

source: -o kubevirt: unknown output option ‘-oo %s’
pt_br: -o kubevirt: opção de saída desconhecida ‘-oo %s’

source: -o libvirt: output pool ‘%s’ does not have /pool/target/path element. See virt-v2v-output-local(1)
pt_br: -o libvirt: o pool de saída ‘%s’ não tem o elemento /pool/target/path. Consulte virt-v2v-output-local(1)

source: -o libvirt: output pool ‘%s’ has type='dir' but the /pool/target/path element is not a local directory. See virt-v2v-output-local(1)
pt_br: -o libvirt: o pool de saída ‘%s’ tem type='dir', mas o elemento /pool/target/path não é um diretório local. Consulte virt-v2v-output-local(1)

source: -o libvirt: output pool ‘%s’ is not a directory (type='dir'). See virt-v2v-output-local(1)
pt_br: -o libvirt: o pool de saída ‘%s’ não é um diretório (type='dir'). Consulte virt-v2v-output-local(1)

source: -o openstack mode only supports -oa sparse -of raw
pt_br: o modo -o openstack só é compatível com -oa sparse -of raw

source: -o openstack: unknown output option ‘-oo %s’
pt_br: -o openstack: opção de saída desconhecida ‘-oo %s’

source: -o ovirt-upload: -oo ovirt-cafile set more than once
pt_br: -o ovirt-upload: -oo ovirt-cafile definido mais de uma vez

source: -o ovirt-upload: -oo ovirt-cluster set more than once
pt_br: -o ovirt-upload: -oo ovirt-cluster definido mais de uma vez

source: -o ovirt-upload: invalid UUID for -oo ovirt-disk-uuid
pt_br: -o ovirt-upload: UUID inválido para -oo ovirt-disk-uuid

source: -o ovirt-upload: output password file was not specified, use ‘-op’ to point to a file which contains the password used to connect to the oVirt server
pt_br: -o ovirt-upload: um arquivo de senha de saída não foi especificado; use '-op' para indicar um arquivo que contenha a senha usada para conectar ao servidor oVirt

source: -o ovirt-upload: output storage was not specified, use ‘-os’
pt_br: -o ovirt-upload: o armazenamento de saída não foi especificado, use ‘-os’

source: -o ovirt-upload: unknown output option ‘-oo %s’
pt_br: -o ovirt-upload: opção de saída desconhecida ‘-oo %s’

source: -o ovirt-upload: use ‘-oc’ to point to the oVirt server REST API URL, which is usually https://servername/ovirt-engine/api
pt_br: -o ovirt-upload: use ‘-oc’ para apontar para a URL da API REST do servidor oVirt, que geralmente é https://servername/ovirt-engine/api

source: -o ovirt: -os option was not specified
pt_br: -o ovirt: a opção -os não foi especificada

source: -o qemu: output directory was not specified, use '-os /dir'
pt_br: -o qemu: o diretório de saída não foi especificado, use '-os /dir'

source: -o qemu: unknown output option ‘-oo %s’
pt_br: -o qemu: opção de saída desconhecida ‘-oo %s’

source: -o vdsm: -oo vdsm-image-uuid was not specified
pt_br: -o vdsm: -oo vdsm-image-uuid não foi especificado

source: -o vdsm: -oo vdsm-ovf-output set more than once
pt_br: -o vdsm: -oo vdsm-ovf-output definido mais de uma vez

source: -o vdsm: -oo vdsm-vm-uuid set more than once
pt_br: -o vdsm: -oo vdsm-vm-uuid definido mais de uma vez

source: -o vdsm: -os option was not specified
pt_br: -o vdsm: a opção -os não foi especificada

source: -o vdsm: either -oo vdsm-vol-uuid or -oo vdsm-vm-uuid was not specified
pt_br: -o vdsm: não foi especificado -oo vdsm-vol-uuid ou -oo vdsm-vm-uuid

source: -o vdsm: unknown output option ‘-oo %s’
pt_br: -o vdsm: opção de saída desconhecida ‘-oo %s’

source: -o vdsm: unknown vdsm-compat level ‘%s’
pt_br: -o vdsm: nível de compatibilidade vdsm desconhecido ‘%s’

source: -os %s: output directory does not exist or is not a directory
pt_br: -os %s: o diretório de saída não existe ou não é um diretório

source: <checksum> missing 'method' attribute, ignoring
pt_br: <checksum> não tem atributo 'method', ignorando

source: <checksum> unknown fail='%s' attribute, ignoring
pt_br: <checksum> com falha desconhecida no atributo '%s', ignorando

source: <disk type='%s'> was ignored
pt_br: <disk type='%s'> foi ignorado

source: <disk type='network'> with <source protocol='%s'> was ignored
pt_br: <disk type='network'> com <source protocol='%s'> foi ignorado

source: <disk type='volume'> with <volume type='%s'> was ignored
pt_br: <disk type='volume'> com <volume type='%s'> foi ignorado

source: <disk> element with no type attribute ignored
pt_br: elemento <disk> sem atributo type ignorado

source: <listen type='%s'> in the input libvirt XML was ignored
pt_br: a linha <listen type='%s'> no XML de entrada do libvirt foi ignorada

source: <target dev='%s'> was ignored because the device name could not be recognized
pt_br: <target dev='%s'> foi ignorado porque o nome do dispositivo não pôde ser reconhecido

source: <vmware:moref> was not found in the output of ‘virsh dumpxml "%s"’. The most likely reason is that libvirt is too old, try upgrading libvirt to ≥ 3.7.
pt_br: <vmware:moref> não foi encontrado na saída de ‘virsh dumpxml "%s"’. O motivo mais provável é que o libvirt está muito desatualizado; tente atualizar o libvirt para uma versão ≥ 3.7.

source: Add package(s) to install
pt_br: Adiciona pacote(s) para instalar

source: Add package(s) to install at first boot
pt_br: Adiciona pacote(s) para instalar na primeira inicialização

source: Append line(s) to the file
pt_br: Adiciona linha(s) ao arquivo

source: Appending line to %s
pt_br: Adicionando linha a %s

source: Change the owner user and group ID of a file or directory
pt_br: Altera o ID de usuário e de dono de um arquivo ou diretório

source: Change the permissions of a file
pt_br: Altera as permissões de um arquivo

source: Changing owner of %s to %d:%d
pt_br: Alterando o dono de %s para %d:%d

source: Changing permissions of %s to %s
pt_br: Alterando permissões de %s para %s

source: Checking %s checksum of disk %d/%d
pt_br: Verificando a soma de verificação %s do disco %d/%d

source: Compatibility option doing nothing
pt_br: Opção de compatibilidade fazendo nada

source: Copy files in disk image
pt_br: Copia arquivos em uma imagem de disco

source: Copy local files or directories from a tarball into image
pt_br: Copia arquivos ou diretórios locais de um tarball para uma imagem

source: Copy local files or directories into image
pt_br: Copia arquivos ou diretórios locais para uma imagem

source: Copying (in image): %s to %s
pt_br: Copiando (na imagem): %s para %s

source: Copying disk %d/%d
pt_br: Copiando disco %d/%d

source: Copying: %s to %s
pt_br: Copiando: %s para %s

source: Create a directory
pt_br: Cria um diretório

source: Create symbolic links
pt_br: Cria links simbólicos

source: Creating output metadata
pt_br: Criando metadados de saída

source: Delete a file or directory
pt_br: Exclui um arquivo ou diretório

source: Deleting: %s
pt_br: Excluindo: %s

source: Display brief help
pt_br: Exibe ajuda breve

source: Display version and exit
pt_br: Exibe a versão e sai

source: Do not relabel files with correct SELinux labels
pt_br: Não rerotula arquivos com rótulos SELinux corretos

source: Don’t print progress messages
pt_br: Não exibe mensagens de progresso

source: Don’t turn off echo for passphrases
pt_br: Não desativa o exibição para senhas

source: Edit file using Perl expression
pt_br: Edita arquivo usando expressão Perl

source: Editing: %s
pt_br: Editando: %s

source: Enable libguestfs debugging messages
pt_br: Habilita mensagens de depuração do libguestfs

source: Enable tracing of libguestfs calls
pt_br: Habilita rastreamento de chamadas do libguestfs

source: External command to run
pt_br: Comando externo para executar

source: FILE
pt_br: ARQUIVO

source: FILE:CONTENT
pt_br: ARQUIVO:CONTEÚDO

source: FILE:DEST
pt_br: ARQUIVO:DESTINO

source: FILE:EXPR
pt_br: ARQUIVO:EXPR

source: FILE:LINE
pt_br: ARQUIVO:LINHA

source: FILENAME
pt_br: NOME-DE-ARQUIVO

source: Finishing off
pt_br: Finalizando

source: HOSTNAME
pt_br: NOME-DO-HOST

source: How to choose root filesystem
pt_br: Como escolher o sistema de arquivos raiz

source: If reporting bugs, run %s with debugging enabled and include the complete output: %s -v -x [...]
pt_br: Se estiver relatando bugs, execute %s com depuração habilitada e inclua a saída completa: %s -v -x [...]

source: Inject a public key into the guest
pt_br: Injeta uma chave pública em um convidado

source: Inject the Balloon Server into a Windows guest
pt_br: Injeta o Balloon Server em um convidado Windows

source: Inject the QEMU Guest Agent into a Windows guest
pt_br: Injeta o QEMU Guest Agent em um convidado Windows

source: Inject virtio-win drivers into a Windows guest
pt_br: Injeta drivers virtio-win em um convidado Windows

source: Input format
pt_br: Formato de entrada

source: Input options (-io) which can be used with -it vddk (all settings are optional): -io vddk-compression=COMPR Set VDDK compression mode (see nbdkit-vddk-plugin documentation) -io vddk-config=FILE VDDK configuration file -io vddk-cookie=COOKIE VDDK cookie -io vddk-file=FILE Override nbdkit-vddk-plugin file= parameter -io vddk-libdir=LIBDIR VDDK library parent directory -io vddk-nfchostport=PORT VDDK nfchostport -io vddk-port=PORT VDDK port -io vddk-snapshot=SNAPSHOT-MOREF VDDK snapshot moref -io vddk-thumbprint=xx:xx:xx:... VDDK server thumbprint -io vddk-transports=MODE:MODE:.. VDDK transports Refer to nbdkit-vddk-plugin(1) and the VDDK documentation for further information on these settings.
pt_br: Opções de entrada (-io) que podem ser usadas com -it vddk (todas as configurações são opcionais): -io vddk-compression=COMPR Define o modo de compressão VDDK (veja a documentação de nbdkit-vddk-plugin) -io vddk-config=ARQUIVO Arquivo de configuração VDDK -io vddk-cookie=COOKIE Cookie VDDK -io vddk-file=ARQUIVO Substitui o parâm. file= de nbdkit-vddk-plugin -io vddk-libdir=LIBDIR Diretório pai da biblioteca VDDK -io vddk-nfchostport=PORTA nfchostport VDDK -io vddk-port=PORTA porta VDDK -io vddk-snapshot=SNAPSHOT-MOREF moref de snapshot VDDK -io vddk-thumbprint=xx:xx:xx:... Impressão digital do servidor VDDK -io vddk-transports=MODE:MODE:.. Transporte VDDK Consulte nbdkit-vddk-plugin(1) e a documentação VDDK para mais informações sobre essas configurações.

source: Input transport
pt_br: Transporte de entrada

source: Installing firstboot command: %s
pt_br: Instalando comando de primeira inicialização: %s

source: Installing firstboot packages: %s
pt_br: Instalando pacotes de primeira inicialização: %s

source: Installing firstboot script: %s
pt_br: Instalando script de primeira inicialização: %s

source: Installing packages: %s
pt_br: Instalando pacotes: %s

source: LOCALPATH:REMOTEDIR
pt_br: CAMINHOLOCAL:DIRREMOTO

source: Libvirt URI
pt_br: URI do Libvirt

source: Linking: %s -> %s
pt_br: Vinculando: %s -> %s

source: METHOD
pt_br: MÉTODO

source: Make output machine readable
pt_br: Torna a saída legível por máquina

source: Making directory: %s
pt_br: Criando diretório: %s

source: Map NIC to network or bridge or assign static IP
pt_br: Mapeia a placa de rede à rede ou ponte ou atribui IP estático

source: Map bridge ‘in’ to ‘out’
pt_br: Mapeia ponte ‘in’ para ‘out’

source: Map network ‘in’ to ‘out’
pt_br: Mapeia rede ‘in’ para ‘out’

source: Move files in disk image
pt_br: Move arquivos em uma imagem de disco

source: Moving: %s -> %s
pt_br: Movendo: %s -> %s

source: No input options can be used in this mode.
pt_br: Nenhuma opção de entrada pode ser usada neste modo.

source: No output options can be used in this mode.
pt_br: Nenhuma opção de saída pode ser usada neste modo.

source: OVF (metadata) directory (%s) does not exist or is not a directory
pt_br: O diretório de OVF (metadados) (%s) não existe ou não é um diretório

source: One of rhsrvany.exe or pvvxsvc.exe is missing in %s. One of them is required in order to install Windows firstboot scripts. You can get one by building rhsrvany (https://github.com/rwmjones/rhsrvany)
pt_br: Um dos arquivos rhsrvany.exe ou pvvxsvc.exe está faltando em %s. Um deles é necessário para instalar os scripts de inicialização do Windows. Você pode obter um compilando o rhsrvany (https://github.com/rwmjones/rhsrvany)

source: Output hypervisor connection
pt_br: Emite a conexão do hipervisor

source: Output options (-oo) which can be used with -o ovirt-upload: -oo ovirt-cafile=CA.PEM Set ‘ca.pem’ certificate bundle filename. -oo ovirt-cluster=CLUSTERNAME Set oVirt cluster name. -oo ovirt-proxy Connect via oVirt Engine proxy (default: false). -oo ovirt-verifypeer[=true|false] Verify server identity (default: false). You can override the UUIDs of the disks, instead of using autogenerated UUIDs after their uploads (if you do, you must supply one for each disk): -oo ovirt-disk-uuid=UUID Disk UUID
pt_br: Opções de saída (-oo) que podem ser usadas com -o ovirt-upload: -oo ovirt-cafile=CA.PEM Define o nome do arquivo do pacote de certificados ‘ca.pem’. -oo ovirt-cluster=NOMECLUSTER Define o nome do cluster oVirt. -oo ovirt-proxy Conecta via proxy do oVirt Engine (padrão: false). -oo ovirt-verifypeer[=true|false] Verifica a identidade do servidor (padrão: false). Você pode substituir os UUIDs dos discos, em vez de usar os UUIDs gerados automaticamente após o upload (se fizer isso, você deve fornecer um para cada disco): -oo ovirt-disk-uuid=UUID UUID do disco

source: Output options (-oo) which can be used with -o qemu: -oo compressed Compress the output file (used only with -of qcow2) -oo qemu-boot Boot the guest in qemu after conversion
pt_br: Opções de saída (-oo) que podem ser usadas com -o qemu: -oo compressed Compacta o arquivo de saída (usado apenas com -of qcow2) -oo qemu-boot Inicializa o convidado no qemu após conversão

source: Output options (-oo) which can be used with -o vdsm: -oo vdsm-compat=0.10|1.1 Write qcow2 with compat=0.10|1.1 (default: 0.10) -oo vdsm-vm-uuid=UUID VM UUID (required) -oo vdsm-ovf-output=DIR OVF metadata directory (required) -oo vdsm-ovf-flavour=%s Set the type of generated OVF (default: ovirtexp) For each disk you must supply one of each of these options: -oo vdsm-image-uuid=UUID Image directory UUID -oo vdsm-vol-uuid=UUID Disk volume UUID
pt_br: Opções de saída (-oo) que podem ser usadas com -o vdsm: -oo vdsm-compat=0.10|1.1 Escreve qcow2 com compat=0.10|1.1 (padrão: 0.10) -oo vdsm-vm-uuid=UUID UUID da VM (obrigatório) -oo vdsm-ovf-output=DIR Diretório de metadados de OVF (obrigatório) -oo vdsm-ovf-flavour=%s Define o tipo de OVF gerado (padrão: ovirtexp) Para cada disco, você deve fornecer um para cada uma dessas opções: -oo vdsm-image-uuid=UUID UUID do diretório de imagem -oo vdsm-vol-uuid=UUID UUID do volume de disco

source: Output options that can be used with -o disk: -oo compressed Compress the output file (used only with -of qcow2)
pt_br: Opções de saída que podem ser usadas com -o disk: -oo compressed Compacta o arquivo de saída (usado apenas com -of qcow2)
