Repository: libguestfs/virt-v2v
Catalog: po/*.po
Languages: pt_br

source: insufficient free space in the conversion server temporary directory %s (%s). Either free up space in that directory, or set the LIBGUESTFS_CACHEDIR environment variable to point to another directory with more than 1GB of free space. See also the virt-v2v(1) manual, section "Minimum free space check in the host".
pt_br: espaço livre insuficiente no diretório temporário do servidor de conversão %s (%s). Libere espaço nesse diretório ou defina a variável de ambiente IBGUESTFS_CACHEDIR para apontar para outro diretório com mais de 1 GB de espaço livre. Consulte também o manual virt-v2v(1), seção "Verificação de espaço livre mínimo no host".

source: internal error: Not_found exception was thrown
pt_br: erro interno: exceção Not_found foi lançada

source: internal error: assertion failed at %s, line %d, char %d
pt_br: erro interno: asserção falhou em %s, linha %d, caractere %d

source: internal error: invalid argument: %s
pt_br: erro interno: argumento inválido: %s

source: internal error: is_file_owned: dpkg command returned no output
pt_br: erro interno: is_file_owned: o comando dpkg retornou nenhuma saída

source: internal error: is_file_owned: unexpected output from dpkg command: %s
pt_br: erro interno: is_file_owned: saída inesperada do comando dpkg: %s

source: internal error: regular expression did not match ‘%s’
pt_br: erro interno: a expressão regular não correspondeu a ‘%s’

source: internal error: wait returned unexpected process ID %d status "%s"
pt_br: erro interno: wait retornou ID de processo inesperado %d com status "%s"

source: invalid --mac ip option
pt_br: opção --mac ip inválido

source: invalid -b/--bridge parameter
pt_br: parâmetro de -b/--bridge inválido

source: invalid -n/--network parameter
pt_br: parâmetro de -n/--network inválido

source: invalid cpuid.coresPerSocket < number of vCPUs
pt_br: cpuid.coresPerSocket inválido < número de vCPUs

source: invalid format for '--%s' parameter, see the man page
pt_br: formato inválido para o parâmetro de '--%s'; consulte a página man

source: invalid format string for --machine-readable: %s
pt_br: string de formato inválida para --machine-readable: %s

source: invalid input filename (%s)
pt_br: nome de arquivo de entrada inválido (%s)

source: invalid offset returned by tar: %S
pt_br: deslocamento inválido retornado por tar: %S

source: invalid output fd for --machine-readable: %s
pt_br: descritor de arquivo de saída inválido para --machine-readable: %s

source: invalid output for --machine-readable: %s
pt_br: saída inválida para --machine-readable: %s

source: invalid output stream for --machine-readable: %s
pt_br: fluxo de saída inválido para --machine-readable: %s

source: invalid password selector ‘%s’; see the man page
pt_br: seletor de senhas inválido ‘%s’; consulte a página man

source: invalid size returned by tar: %S
pt_br: tamanho inválido retornado por tar: %S

source: invalid ssh-inject selector ‘%s’; see the man page
pt_br: seletor de ssh-inject inválido ‘%s’; consulte a página man

source: invalid vmw:CoresPerSocket (%d) ignored
pt_br: vmw:CoresPerSocket inválido (%d) ignorado

source: invalid vmw:CoresPerSocket < number of cores
pt_br: vmw:CoresPerSocket inválido < número de núcleos

source: kernel %s is not under grub tree %s
pt_br: o kernel %s não está na árvore de grub %s

source: killed by signal %d
pt_br: morto pelo sinal %d

source: libguestfs error: %s
pt_br: erro do libguestfs: %s

source: libvirt domain ‘%s’ is running or paused. Converting a live guest will result in corrupted output. However this is safe if you're converting from a snapshot
pt_br: o domínio libvirt '%s' está em execução ou pausado. Converter uma máquina virtual em execução resultará em saída corrompida. No entanto, isso é seguro se você estiver convertendo a partir de um snapshot

source: log file %s: %s (ignored)
pt_br: arquivo log %s: %s (ignorado)

source: making OVA directory public readable to work around libvirt bug https://bugzilla.redhat.com/1045069
pt_br: tornando o diretório OVA público e legível para contornar o bug do libvirt https://bugzilla.redhat.com/1045069

source: manifest has a checksum for non-existent file %s (ignored)
pt_br: o manifesto tem uma soma de verificação para um arquivo não existente %s (ignorado)

source: method '%s' is no longer supported
pt_br: o método '%s' não é mais suportado

source: missing value for the key ‘%s’
pt_br: faltando um valor para a chave ‘%s’

source: more than one .ovf file was found in %s
pt_br: mais de um arquivo .ovf foi encontrado em %s

source: more than value for the key ‘%s’
pt_br: mais de um valor para a chave ‘%s’

source: mount command failed, see earlier errors. This probably means you didn't specify the right %s path [-os %s], or else you need to rerun virt-v2v as root.
pt_br: o comando mount falhou. Consulte os erros anteriores. Isso provavelmente significa que você não especificou o caminho %s correto [-os %s], ou então precisa executar o virt-v2v novamente como root.

source: multiple --root-password/--password options set the password for user ‘%s’ twice
pt_br: várias opções --root-password/--password definem a senha do usuário ‘%s’ duas vezes

source: nbdkit VDDK plugin is not installed or not working. It is required if you want to use VDDK. It looks like you did not set the right path in the ‘-io vddk-libdir’ option, or your copy of the VDDK directory is incomplete. There should be a library called ’<libdir>/%s/libvixDiskLib.so.?’. See also the virt-v2v-input-vmware(1) manual.
pt_br: O plugin VDDK do nbdkit não está instalado ou não está funcionando. Ele é necessário para usar o VDDK. Parece que você não definiu o caminho correto na opção ‘-io vddk-libdir’, ou sua cópia do diretório VDDK está incompleta. Deveria haver uma biblioteca chamada ‘<libdir>/%s/libvixDiskLib.so.?’. Veja também o manual virt-v2v-input-vmware(1).

source: nbdkit VDDK plugin is not installed or not working. It is required if you want to use VDDK. The VDDK plugin is not enabled by default when you compile nbdkit. You have to read the instructions in the nbdkit sources under ‘plugins/vddk/README.VDDK’ to find out how to enable the VDDK plugin. See also the virt-v2v-input-vmware(1) manual.
pt_br: O plugin VDDK do nbdkit não está instalado ou não está funcionando. Ele é necessário para usar o VDDK. O plugin VDDK não está habilitado por padrão ao compilar o nbdkit. Você precisa ler as instruções nos arquivos-fonte do nbdkit em ‘plugins/vddk/README.VDDK’ para descobrir como habilitar o plugin VDDK. Veja também o manual virt-v2v-input-vmware(1).

source: nbdkit did not start up. See previous debugging messages for problems.
pt_br: o nbdkit não foi iniciado. Consulte as mensagens de depuração anteriores para obter detalhes sobre o problema.

source: nbdkit did not start up. There may be errors printed by nbdkit above. If the messages above are not sufficient to diagnose the problem then add the ‘virt-v2v -v -x’ options and examine the debugging output carefully.
pt_br: o nbdkit não foi iniciado. Podem existir erros exibidos pelo nbdkit acima. Se as mensagens acima não forem suficientes para diagnosticar o problema, adicione as opções ‘virt-v2v -v -x’ e examine cuidadosamente a saída de depuração.

source: nbdkit is not installed or not working
pt_br: o nbdkit não está instalado ou não está funcionando

source: nbdkit is not installed or not working. It is required to use ‘-i disk’.
pt_br: o nbdkit não está instalado ou não está funcionando. É necessário usar ‘-i disk’.

source: nbdkit is not installed or not working. It is required to use ‘-i libvirt|libvirtxml’.
pt_br: o nbdkit não está instalado ou não está funcionando. É necessário usar ‘-i libvirt|libvirtxml’.

source: nbdkit is not installed or not working. It is required to use ‘-o disk’.
pt_br: o nbdkit não está instalado ou não está funcionando. É necessário usar ‘-o disk’.

source: nbdkit is not installed or not working. It is required to use ‘-o null’.
pt_br: o nbdkit não está instalado ou não está funcionando. É necessário usar ‘-o null’.

source: nbdkit is not installed or not working. It is required to use ‘-o ovirt-upload’. See the virt-v2v-output-ovirt(1) manual.
pt_br: o nbdkit não está instalado ou não está funcionando. É necessário usar ‘-o ovirt-upload’. Consulte o manual virt-v2v-output-ovirt(1).

source: nbdkit must be >= 1.45.11 for input from VDDK
pt_br: o nbdkit deve ser >= 1.45.11 para entrada de VDDK

source: nbdkit python plugin is not installed or not working. It is required if you want to use ‘-o ovirt-upload’. See also the virt-v2v-output-ovirt(1) manual.
pt_br: O plugin Python do nbdkit não está instalado ou não está funcionando. Ele é necessário para usar ‘-o ovirt-upload’. Veja também o manual do virt-v2v-output-ovirt(1).

source: nbdkit was compiled without SELinux support. You will have to recompile nbdkit with libselinux-devel installed, or else set SELinux to Permissive mode while doing the conversion.
pt_br: o nbdkit foi compilado sem suporte a SELinux. Você precisará recompilar o nbdkit com o pacote libselinux-devel instalado ou, então, configurar o SELinux para o modo Permissive durante a conversão.

source: nbdkit-cow-filter is not installed or not working
pt_br: nbdkit-cow-filter não está instalado ou não está funcionando

source: nbdkit-curl-plugin is not installed
pt_br: nbdkit-curl-plugin não está instalado

source: nbdkit-file-plugin is not installed or not working
pt_br: nbdkit-file-plugin não está instalado ou não está funcionando

source: nbdkit-nbd-plugin is not installed or not working
pt_br: nbdkit-nbd-plugin não está instalado ou não está funcionando

source: nbdkit-null-plugin is not installed or not working
pt_br: nbdkit-null-plugin não está instalado ou não está funcionando

source: nbdkit-ssh-plugin is not installed
pt_br: nbdkit-ssh-plugin não está instalado

source: nbdkit-vddk-plugin is not installed
pt_br: nbdkit-vddk-plugin não está instalado

source: nbdkit: unexpected version in --dump-config: %s
pt_br: nbdkit: versão inesperada em --dump-config: %s

source: no -io (input options) are allowed here
pt_br: não é permitido -io (opções de entrada) aqui

source: no -oo (output options) are allowed here
pt_br: não é permitido -oo (opções de saída) aqui

source: no .ovf file was found in %s
pt_br: nenhum arquivo .ovf foi encontrado em %s

source: no bootloader detected
pt_br: nenhum carregador de inicialização detectado

source: no displayName key found in VMX file
pt_br: nenhuma chave displayName encontrada no arquivo VMX

source: no href in ovf:File (id=%s)
pt_br: nenhum href em ovf:File (id=%s)

source: no initrd was found in /boot matching %s %s.
pt_br: nenhum initrd foi encontrado em /boot correspondendo a %s %s.

source: no installed kernel packages were found. This probably indicates that %s was unable to inspect this guest properly.
pt_br: nenhum pacote de kernel instalado foi encontrado. Isso provavelmente indica que %s não conseguiu inspecionar este convidado corretamente.

source: no kernels were found in the bootloader configuration. This probably indicates that %s was unable to parse the bootloader configuration of this guest.
pt_br: nenhum kernel foi encontrado na configuração do carregador de inicialização. Isso provavelmente indica que %s não conseguiu analisar a configuração do carregador de inicialização deste convidado.

source: no python binary called ‘%s’ can be found on the $PATH
pt_br: não foi possível encontrar nenhum binário Python chamado ‘%s’ no $PATH

source: no support for remote libvirt connections to '-ic %s'. The conversion may fail when it tries to read the source disks.
pt_br: não há suporte para conexões remotas do libvirt com '-ic %s'. A conversão pode falhar ao tentar ler os discos de origem.

source: oVirt cannot emulate ‘%s’ sound cards. This sound card will be dropped from the output.
pt_br: o oVirt não consegue emular placas de som ‘%s’. Essa placa de som será removida da saída.

source: oVirt does not support the output format ‘%s’, only raw or qcow2
pt_br: oVirt não suporta o formato de saída ‘%s‘, apenas raw ou qcow2

source: openstack: -oo server-id=<NAME|UUID> not present
pt_br: openstack: -oo server-id=<NAME|UUID> não presente

source: openstack: failed to attach cinder volume to VM, see earlier error messages
pt_br: openstack: falha ao anexar o volume cinder à VM, consulte as mensagens de erro anteriores

source: openstack: failed to create a cinder volume, see earlier error messages
pt_br: openstack: falha ao criar um volume cinder, consulte as mensagens de erro anteriores

source: openstack: failed to query cinder volume status, see earlier error messages
pt_br: openstack: falha ao consultar o status do volume cinder, consulte as mensagens de erro anteriores

source: openstack: failed to set image properties on cinder volume, see earlier error messages
pt_br: openstack: falha ao definir as propriedades de imagem em volume cinder, consulte as mensagens de erro anteriores

source: openstack: precheck failed, there may be a problem with authentication, see earlier error messages
pt_br: openstack: precheck falhou, pode haver um problema com a autenticação, consulte as mensagens de erro anteriores

source: openstack: unknown volume status "%s": expected "creating" or "available"
pt_br: openstack: status de volume desconhecido "%s": esperava "creating" ou "available"

source: output mode only supports raw or qcow2 format (format: %s)
pt_br: o modo de saída só suporta os formatos raw ou qcow2 (formato: %s)

source: ova disk has an unknown VMware controller type (%d), please report this as a bug supplying the *.ovf file extracted from the ova
pt_br: o disco ova tem um tipo de controlador VMware desconhecido (%d), relate isso como um bug fornecendo o arquivo *.ovf extraído do ova

source: ova disk has no parent controller, please report this as a bug supplying the *.ovf file extracted from the ova
pt_br: o disco ova tem nenhum controlador pai, relate isso como um bug fornecendo o arquivo *.ovf extraído do ova

source: ovirt-upload: -of %s: Only output format ‘raw’ or ‘qcow2’ is supported. If the input is in a different format then force one of these output formats by adding either ‘-of raw’ or ‘-of qcow2’ on the command line.
pt_br: ovirt-upload: -of %s: Somente os formatos de saída 'raw' ou 'qcow2' são suportados. Se a entrada estiver em um formato diferente, force um desses formatos de saída adicionando '-of raw' ou '-of qcow2' na linha de comando.

source: password-crypto: unknown algorithm %s, use "md5", "sha256", "sha512" or "yescrypt"
pt_br: password-crypto: um algoritmo desconhecido %s, use "md5", "sha256", "sha512" ou "yescrypt"

source: password: using insecure md5 password encryption for guest of type %s version %d.%d. If this is incorrect, use --password-crypto option and file a bug.
pt_br: password: usando criptografia de senha md5 insegura para convidado do tipo %s versão %d.%d. Se isso estiver incorreto, use a opção --password-crypto e registre um bug.

source: passwords could not be set for this type of guest
pt_br: senhas não puderam ser definidas para este tipo de convidado

source: qemu-nbd did not start up. See previous debugging messages for problems.
pt_br: O qemu-nbd não iniciou. Veja mensagens de depuração anterior por problemas.

source: qemu-nbd did not start up. There may be errors printed by qemu-nbd above. If the messages above are not sufficient to diagnose the problem then add the ‘virt-v2v -v -x’ options and examine the debugging output carefully.
pt_br: O qemu-nbd não iniciou. Podem existir erros impressos pelo qemu-nbd acima. Se as mensagens acima não forem suficientes para diagnosticar o problema, adicione as opções ‘virt-v2v -v -x’ e examine cuidadosamente a saída de depuração.

source: qemu-nbd: unexpected version in --version: %s
pt_br: qemu-nbd: versão ini=esperada em --version: %s

source: random seed could not be set for this type of guest
pt_br: semente aleatória não pôde ser definida para este tipo de convidado

source: remote vmx ‘%s’ could not be parsed as a URI
pt_br: vmx remoto ‘%s’ não pôde ser analisado como um URI

source: root directory ‘/’ is missing from the virtio-win directory or ISO. This should not happen and may indicate that virtio-win or virt-v2v is broken in some way. Please report this as a bug with a full debug log.
pt_br: diretório raiz ‘/’ está em falta no diretório virtio-win ou ISO. Isso não deveria acontecer e pode indicar que o virtio-win ou o virt-v2v está com algum problema. Por favor, relate isso como um bug com um log de depuração completo.

source: selector '%s': invalid TYPE
pt_br: seletor '%s': TYPE inválido

source: selector '%s': missing FILENAME, or too many fields
pt_br: seletor '%s': FILENAME em falta ou muitos campos

source: selector '%s': missing ID
pt_br: seletor '%s': ID em falta

source: selector '%s': missing KEY_STRING, or too many fields
pt_br: seletor '%s': KEY_STRING em falta ou muitos campos

source: selector '%s': missing TYPE
pt_br: seletor '%s': TYPE em falta

source: selector '%s': too many fields
pt_br: seletor '%s': muitos campos

source: signalled by signal %d
pt_br: sinalizado pelo sinal %d

source: sorry, ‘%s’ with the ‘%s’ package manager has not been implemented yet. You can work around this by using one of the ‘--run*’ or ‘--firstboot*’ options instead (described in the virt-customize(1) manual).
pt_br: Desculpe, o uso de ‘%s’ com o gerenciador de pacotes ‘%s’ ainda não foi implementado. Você pode contornar isso usando uma das opções ‘--run*’ ou ‘--firstboot*’ (descritas no manual virt-customize(1)).

source: ssh-agent authentication has not been set up ($SSH_AUTH_SOCK is not set). This is required by qemu to do passwordless ssh access. See the virt-v2v(1) man page for more information.
pt_br: A autenticação do ssh-agent não foi configurada ($SSH_AUTH_SOCK não está definido). Isso é necessário para que o qemu permita acesso ssh sem senha. Consulte a página de manual virt-v2v(1) para obter mais informações.

source: ssh-inject: $HOME environment variable is not set
pt_br: ssh-inject: variável de ambiente $HOME não definida

source: ssh-inject: key is an empty string
pt_br: ssh-inject: a chave é uma string vazia

source: ssh-inject: no public key file found in %s
pt_br: ssh-inject: nenhum arquivo de chave pública encontrado em %s

source: ssh-inject: public key file (%s) is empty
pt_br: ssh-inject: o arquivo de chave pública (%s) está vazio

source: ssh-inject: the user %s does not exist on the guest
pt_br: ssh-inject: o usuário %s não existe no convidado

source: stopped by signal %d
pt_br: parado pelo sinal %d

source: subprocess exited with non-zero error code %d
pt_br: o subprocesso foi encerrado com código de erro não-zero %d

source: subprocess signalled or stopped by signal %d
pt_br: subprocesso sinalizado ou parado pelo sinal %d

source: success
pt_br: sucesso

source: target hypervisor does not support floppy devices, but floppy devices were found in the source guest
pt_br: o hipervisor alvo não suporta dispositivos de disquete, mas dispositivos de disquete foram encontrados no sistema operacional convidado de origem

source: the Python module ‘ovirtsdk4’ could not be loaded, is it installed? See previous messages for problems.
pt_br: o módulo Python ‘ovirtsdk4’ não pôde ser carregado. Ele está instalado? Consulte as mensagens anteriores para obter mais detalhes sobre o problema.

source: the cluster ‘%s’ does not support the architecture %s but %s
pt_br: o cluster ‘%s’ não suporta a arquitetura %s, mas sim a arquitetura %s

source: the command may have failed because the network is disabled. Try either removing ‘--no-network’ or adding ‘--network’ on the command line.
pt_br: o comando pode ter falhado porque a rede está desabilitada. Tente remover ‘--no-network’ ou adicionar ‘--network’ na linha de comando.

source: the key ‘%s’ was not found in a list of objects
pt_br: a chave ‘%s’ não foi encontrada na lista de objetos

source: the number of ‘-oo ovirt-disk-uuid’ parameters passed on the command line has to match the number of guest disk images (for this guest: %d)
pt_br: oO número de parâmetros ‘-oo ovirt-disk-uuid’ passados na linha de comando deve corresponder ao número de imagens de disco do convidado (para este convidado: %d)

source: the number of ‘-oo vdsm-image-uuid’ and ‘-oo vdsm-vol-uuid’ parameters passed on the command line has to match the number of guest disk images (for this guest: %d)
pt_br: o número de parâmetros ‘-oo vdsm-image-uuid’ e ‘-oo vdsm-vol-uuid’ passados na linha de comando deve corresponder ao número de imagens de disco do convidado (para este convidado: %d)

source: the target hypervisor does not support a %s KVM guest
pt_br: o hipervisor de destino não suporta um convidado KVM %s

source: the value for key ‘%s’ is not a string as expected
pt_br: o valor da chave ‘%s’ não é uma string como esperado

source: the value for the key ‘%s’ is not a bool
pt_br: o valor da chave ‘%s’ não é um booleano

source: the value for the key ‘%s’ is not a string
pt_br: o valor da chave ‘%s’ não é uma string

source: the value for the key ‘%s’ is not an integer
pt_br: o valor da chave ‘%s’ não é um inteiro

source: the value for the key ‘%s’ is not an object
pt_br: o valor da chave ‘%s’ não é um objeto

source: the value is not an object
pt_br: o valor não é um objeto

source: the value of the key ‘%s’ is not an object
pt_br: o valor da chave ‘%s’ não é um objeto

source: the virtual size of the input disk %d is not an exact multiple of 512 bytes. The virtual size is: %Ld. This probably means something unexpected is going on, so please file a bug about this issue.
pt_br: O tamanho virtual do disco de entrada %d não é um múltiplo exato de 512 bytes. O tamanho virtual é: %Ld. Isso provavelmente significa que algo inesperado está acontecendo, então, por favor, relate um bug sobre esse problema.

source: the ‘%s’ program is not available. It is needed to communicate with OpenStack.
pt_br: o programa ‘%s’ não está disponível. Ele é necessário para a comunicação com o OpenStack.

source: there are multiple UUIDs in the %s (%s). This is unexpected, and may be a bug in virt-v2v or OVirt.
pt_br: existem vários UUIDs em %s (%s). Isso é inesperado e pode ser um bug no virt-v2v ou no OVirt.

source: there are no UUIDs in the %s (%s). Is it really an OVirt %s?
pt_br: não há UUIDs em %s (%s). É realmente um %s do OVirt?

source: there are no virtio drivers available for this version of Windows (%d.%d %s %s %s). virt-v2v looks for drivers in %s The guest will be configured to use slower emulated devices.
pt_br: não há drivers virtio disponíveis para esta versão do Windows (%d.%d %s %s %s). O virt-v2v procura drivers em %s. O sistema convidado será configurado para usar dispositivos emulados mais lentos.

source: there is no virtio block device driver for this version of Windows (%d.%d %s). virt-v2v looks for this driver in %s The guest will be configured to use a slower emulated device.
pt_br: não existe um driver de dispositivo de bloco virtio para esta versão do Windows (%d.%d %s). O virt-v2v procura este driver em %s O sistema convidado será configurado para usar um dispositivo emulado mais lento.

source: there is no virtio network driver for this version of Windows (%d.%d %s). virt-v2v looks for this driver in %s The guest will be configured to use a slower emulated device.
pt_br: não existe um driver de rede virtio para esta versão do Windows (%d.%d %s). O virt-v2v procura este driver em %s O sistema convidado será configurado para usar um dispositivo emulado mais lento.

source: this guest has a direct network interface which will be ignored
pt_br: este convidado tem uma interface de rede direta que será ignorada

source: this guest has a passthrough host device which will be ignored
pt_br: este convidado tem um dispositivo de host em passthrough que será ignorado
