Repository: libguestfs/virt-v2v
Catalog: po/*.po
Languages: pt_br

source: Output options that can be used with -o kubevirt: -oo compressed Compress the output file (used only with -of qcow2) -oo create=false Do not create the output disks -oo disk=disk1 Specify filename of output disk (if used, must be given once for each disk, else -os path is used)
pt_br: Opções de saída que podem ser usadas com -o kubevirt: -oo compressed Compacta o arquivo de saída (usado apenas com -of qcow2) -oo create=false Não cria os discos de saída -oo disk=disk1 Especifica nome de arquivo do disco de saída (se usado, deve ser dado uma vez para cada disco, do contrário -os path é usado)

source: Output options that can be used with -o libvirt: -oo compressed Compress the output file (used only with -of qcow2)
pt_br: Opções de saída que podem ser usadas com -o libvirt: -oo compressed Compacta o arquivo de saída (usado apenas com -of qcow2)

source: PATH
pt_br: CAMINHO

source: PERMISSIONS:FILE
pt_br: PERMISSÕES:ARQUIVO

source: Prefer 'virtio-blk' or 'virtio-scsi'
pt_br: Prefira 'virtio-blk' ou 'virtio-scsi'

source: Print source and stop
pt_br: Exibe a fonte e para

source: Read customize commands from file
pt_br: Lê comandos personalizados do arquivo

source: Read passphrases from stdin
pt_br: Lê senhas da entrada padrão (stdin)

source: Recursively truncate all files in directory
pt_br: Trunca recursivamente todos os arquivos no diretório

source: Recursively truncating: %s
pt_br: Truncando recursivamente: %s

source: Rename guest when converting
pt_br: Renomeia o convidado ao converter

source: Run command at first guest boot
pt_br: Executa o comando na primeira inicialização do convidado

source: Run command in disk image
pt_br: Executa comando na imagem de disco

source: Run script at first guest boot
pt_br: Executa script na primeira inicialização do convidado

source: Run script in disk image
pt_br: Executa script na imagem de disco

source: Run touch on a file
pt_br: Executa touch em um arquivo

source: Run up to N instances of nbdcopy in parallel
pt_br: Executa até N instâncias de nbdcopy em paralelo

source: Running external command
pt_br: Executando comando externo

source: Running touch: %s
pt_br: Executando touch: %s

source: Running: %s
pt_br: Executando: %s

source: SELECTOR
pt_br: SELETOR

source: SELinux relabelling
pt_br: Re-rotulação SELinux

source: SOURCE:DEST
pt_br: FONTE:DESTINO

source: SSH key could not be injected for this type of guest
pt_br: A chave SSH não pôde ser injetada para este tipo de convidado

source: SSH key inject: %s
pt_br: Injeção de chave SSH: %s

source: Scrub a file
pt_br: Exclui permanentemente um arquivo

source: Scrub build log file
pt_br: Exclui permanentemente o arquivo de log de compilação

source: Scrubbing the log file
pt_br: Excluindo permanentemente o arquivo de log

source: Scrubbing: %s
pt_br: Excluindo permanentemente: %s

source: Set bandwidth dynamically from file
pt_br: Defina a largura de banda dinamicamente a partir de um arquivo

source: Set bandwidth to bits per sec
pt_br: Defina a largura de banda para bits por segundo

source: Set input mode (default: libvirt)
pt_br: Define o modo de entrada (padrão: libvirt)

source: Set memory size
pt_br: Define o tamanho da memória

source: Set number of vCPUs
pt_br: Define o número de vCPUs

source: Set option for input mode
pt_br: Define opção para o modo de entrada

source: Set option for output mode
pt_br: Define opção para o modo de saída

source: Set output allocation mode
pt_br: Define o modo de alocação da saída

source: Set output format
pt_br: Define o formato da saída

source: Set output mode (default: libvirt)
pt_br: Define o modo de saída (padrão: libvirt)

source: Set output storage location
pt_br: Define o local de armazenamento da saída

source: Set password crypto
pt_br: Define crypto da senha

source: Set program name
pt_br: Define o nome do programa

source: Set root password
pt_br: Define a senha do root

source: Set the default timezone
pt_br: Define o fuso horário padrão

source: Set the hostname
pt_br: Define nome de host

source: Set the output filename
pt_br: Define o nome de arquivo da saída

source: Set user password
pt_br: Define a senha do usuário

source: Setting a random seed
pt_br: Definindo uma semente aleatória

source: Setting passwords
pt_br: Definindo senhas

source: Setting random password of %s to %s
pt_br: Definindo uma senha aleatória de %s para %s

source: Setting the hostname: %s
pt_br: Definindo o nome de host: %s

source: Setting the machine ID in %s
pt_br: Definindo o ID de máquina em %s

source: Setting the timezone: %s
pt_br: Definindo o fuso horário: %s

source: Setting up the destination: %s
pt_br: Configurando o destino: %s

source: Setting up the source: %s
pt_br: Configurando a fonte: %s

source: Source guest information (--print-source option):
pt_br: Informações de fonte do convidado (a opção --print-source):

source: Specify a LUKS key
pt_br: Especifica uma chave LUKS

source: TARFILE:REMOTEDIR
pt_br: ARQUIVOTAR:DIRREMOTO

source: TARGET:LINK[:LINK..]
pt_br: ALVO:LINK[:LINK..]

source: TIMEZONE
pt_br: FUSO-HORÁRIO

source: The --in-place option has been replaced by the ‘virt-v2v-in-place’ program
pt_br: A opção --in-place foi substituída pelo programa 'virt-v2v-in-place'

source: The Virt machine has no support for IDE. Please report a bug for virt-v2v -- refer to virt-v2v(1) section "BUGS".
pt_br: A máquina Virt não oferece suporte para IDE. Relate um bug para irt-v2v -- consulte a seção "BUGS" de virt-v2v(1).

source: The Virt machine has no support for floppies. Please report a bug for virt-v2v -- refer to virt-v2v(1) section "BUGS".
pt_br: A máquina Virt não oferece suporte para disquetes. Relate um bug para irt-v2v -- consulte a seção "BUGS" de virt-v2v(1).

source: This guest required a password for connection to its display, but this is not supported by oVirt. Therefore the converted guest’s display will not require a separate password to connect.
pt_br: Este convidado exigiu uma senha para a conexão com sua tela, mas isso não é suportado pelo oVirt. Portanto, a tela do convidado convertido não vai exigir uma senha separada para se conectar a ele.

source: This transport does not support guests with snapshots. Either collapse the snapshots for this guest and try the conversion again, or use one of the alternate conversion methods described in virt-v2v-input-vmware(1) section "NOTES".
pt_br: Este transporte não suporta convidados com snapshots. Ou desfaça os snapshots para este convidado e tente a conversão novamente, ou use um dos métodos de conversão alternativos descritos na seção "NOTES" de virt-v2v-input-vmware(1).

source: Truncate a file to zero size
pt_br: Trunca um arquivo para tamanho zero

source: Truncating: %s
pt_br: Truncando: %s

source: UID:GID:PATH
pt_br: UID:GID:CAMINHO

source: USER:SELECTOR
pt_br: USUÁRIO:SELETOR

source: USER[:SELECTOR]
pt_br: USUÁRIO[:SELETOR]

source: Uninstall package(s)
pt_br: Desinstala pacote(s)

source: Uninstalling packages: %s
pt_br: Desinstalando pacotes: %s

source: Unpack tar file: %s to %s
pt_br: Desempacotamento de arquivo tar: %s para %s

source: Update packages
pt_br: Atualiza pacotes

source: Updating packages
pt_br: Atualizando pacotes

source: Upload local file to destination
pt_br: Atualiza arquivo local para destino

source: Uploading: %s to %s
pt_br: Enviando: %s para %s

source: Use ANSI colour sequences even if not tty
pt_br: Usa sequências de cores ANSI mesmo se não estiver em um terminal (tty)

source: Use password from file to connect to input hypervisor
pt_br: Usa a senha de um arquivo para conectar ao hipervisor de entrada

source: Use password from file to connect to output hypervisor
pt_br: Usa a senha de um arquivo para conectar ao hipervisor de saída

source: Use virt-v2v-in-place instead
pt_br: Usa virt-v2v-in-place em vez disso

source: Wrap log messages even if not tty
pt_br: Quebra linha de mensagens de log mesmo se não estiver no terminal (tty)

source: Write file
pt_br: Escreve o arquivo

source: Writing: %s
pt_br: Escrevendo: %s

source: YAML block contains newline character. This should not happen, please report a bug against virt-v2v.
pt_br: O bloco YAML contém um caractere de nova linha. Isso não deveria acontecer. Relate um bug para o virt-v2v.

source: a libvirt domain called ‘%s’ already exists on the target. If using virt-v2v directly, use the ‘-on’ option to select a different name. Or delete the existing domain on the target using the ‘virsh undefine’ command. If using virt-p2v, select a different ‘Name’ in the ‘Target properties’. Or delete the existing domain on the target using the ‘virsh undefine’ command.
pt_br: Um domínio libvirt chamado ‘%s’ já existe no alvo. Se estiver usando o virt-v2v diretamente, use a opção ‘-on’ para selecionar um nome diferente. Ou exclua o domínio existente no destino usando o comando ‘virsh undefine’. Se estiver usando o virt-p2v, selecione um ‘Name’ diferente em ‘Target properties’. Ou exclua o domínio existente no destino usando o comando ‘virsh undefine’.

source: append_line: %s is not a file
pt_br: append_line: %s não é um arquivo

source: bad checksum for disk %d/%d Expected checksum: %s Actual checksum: %s
pt_br: checksum inválido para o disco %d/%d Checksum esperado: %s Checksum encontrado: %s

source: cannot find libvirt domain ‘%s’: %s
pt_br: não foi possível encontrar o domínio libvirt ‘%s’: %s

source: cannot find libvirt pool ‘%s’: %s Use ‘virsh pool-list --all’ to list all available pools, and ‘virsh pool-dumpxml <pool>’ to display details about a particular pool. To set the pool which virt-v2v uses, add the ‘-os <pool>’ option.
pt_br: não foi possível encontrar o pool libvirt ‘%s’: %s Use ‘virsh pool-list --all’ para listar todos os pools disponíveis e ‘virsh pool-dumpxml <pool>’ para exibir detalhes sobre um pool específico. Para definir o pool que o virt-v2v utiliza, adicione a opção ‘-os <pool>’.

source: cannot find libvirt volume ‘%s’: %s
pt_br: não foi possível encontrar o volume libvirt ‘%s’: %s

source: cannot finish firstboot installation by running ‘%s’ because host cpu (%s) and guest arch (%s) are not compatible. The firstboot service may not run at boot.
pt_br: não foi possível concluir a instalação de primeira inicialização executando ‘%s’ porque a CPU do host (%s) e a arquitetura do convidado (%s) não são compatíveis. O serviço de primeira inicialização pode não ser executado na inicialização.

source: cannot get libvirt domain capabilities: %s
pt_br: não foi possível obter recursos de domínio libvirt: %s

source: cannot get libvirt hypervisor capabilities: %s
pt_br: não foi possível obter os recursos do hipervisor libvirt: %s

source: cannot parse --mac "%s" parameter
pt_br: não foi possível analisar o parâmetro --mac "%s"

source: cannot parse --mac ip %s: doesn’t look like “%s” is an IP address
pt_br: não foi possível analisar o ip de --mac %s: parece que “%s” não é um endereço IP

source: cannot use ‘%s’ because no package manager has been detected for this guest OS. If this guest OS is a common one with ordinary package management then this may have been caused by a failure of libguestfs inspection. For OSes such as Windows that lack package management, this is not possible. Try using one of the ‘--firstboot*’ flags instead (described in the virt-customize(1) manual).
pt_br: não foi possível usar ‘%s’ porque nenhum gerenciador de pacotes foi detectado para este sistema operacional convidado. Se este sistema operacional convidado for comum e possuir gerenciamento de pacotes padrão, isso pode ter sido causado por uma falha na inspeção da libguestfs. Para sistemas operacionais como o Windows, que não possuem gerenciamento de pacotes, isso não é possível. Tente usar uma das opções ‘--firstboot*’ (descritas no manual do virt-customize(1)).

source: cannot write files to the NFS server as %d:%d, even though we appear to be running as root. This probably means the NFS client or idmapd is not configured properly. You will have to chown the files that virt-v2v creates after the run, otherwise oVirt will not be able to import the VM.
pt_br: não foi possível gravar arquivos no servidor NFS como %d:%d, mesmo que pareça que estamos executando como root. Isso provavelmente significa que o cliente NFS ou o idmapd não estão configurados corretamente. Você precisará alterar o proprietário dos arquivos criados pelo virt-v2v após a execução; caso contrário, o oVirt não conseguirá importar a máquina virtual.

source: cannot write files to the NFS server as %d:%d. You might want to stop virt-v2v (^C) and rerun it as root.
pt_br: não foi possível gravar arquivos no servidor NFS como %d:%d. Você pode tentar interromper o virt-v2v (^C) e executá-lo novamente como root.

source: command '%s' cannot be used in command files, see the man page
pt_br: O comando '%s' não pode ser usado em arquivos de comando; consulte a página man

source: command '%s' not valid, see the man page
pt_br: o comando '%s' não é válido, consulte a página man

source: could not add grub2 serial console (ignored)
pt_br: não foi possível adicionar o console serial do grub2 (ignorado)

source: could not copy the VMX file from the remote server, see earlier error messages
pt_br: não foi possível copiar o arquivo VMX do servidor remoto, consulte as mensagens de erro anteriores

source: could not define libvirt domain: %s. The libvirt XML is still available in ‘%s’. Try running ‘virsh -c %s define %s’ yourself instead.
pt_br: não foi possível definir o domínio libvirt: %s. O XML do libvirt ainda está disponível em ‘%s’. Tente executar ‘virsh -c %s define %s’ manualmente.

source: could not determine a way to update the configuration of Grub2
pt_br: não foi possível determinar uma maneira de atualizar a configuração do Grub2

source: could not fetch thumbprint from the server, you mus use ‘-io vddk-thumbprint=XX:XX...’
pt_br: não foi possível obter a impressão digital do servidor. Você deve usar '-io vddk-thumbprint=XX:XX...'

source: could not find bootloader mount point (%s): %s
pt_br: não foi possível encontrar o ponto de montagem do carregador de inicialização (%s): %s

source: could not find registry entry HKEY_LOCAL_MACHINE\SYSTEM\DriverDatabase\DeviceIds in this Windows guest. It may be either a very old or very new version of Windows that we cannot process.
pt_br: não foi possível encontrar a entrada de registro HKEY_LOCAL_MACHINE\SYSTEM\DriverDatabase\DeviceIds nesta máquina virtual Windows. Pode ser uma versão muito antiga ou muito recente do Windows que não podemos processar.

source: could not finish firstboot installation by running ‘%s’ because the command failed: %s
pt_br: não foi possível concluir a instalação de primeira inicialização executando ‘%s’ porque o comando falhou: %s

source: could not parse '-ic %s'. Original error message was: %s
pt_br: não foi possível analisar '-ic %s'. A mensagem de erro original foi: %s

source: could not parse device name ‘%s’ from the source libvirt XML
pt_br: não foi possível analisar o nome do dispositivo '%s' do XML de origem do libvirt

source: could not parse disk rasd:HostResource from OVF document
pt_br: não foi possível analisar o recurso de disco rasd:HostResource do documento OVF

source: could not parse ovf:Name from OVF document
pt_br: não foi possível analisar ovf:Name do documento OVF

source: could not read the %s specified by the '-os %s' parameter on the command line. Is it really an OVirt %s? The original error is: %s
pt_br: não foi possível ler o %s especificado pelo parâmetro '-os %s' na linha de comando. É realmente um %s do OVirt? O erro original é: %s

source: could not rebuild grub2 configuration file (%s). This may mean that grub output will not be sent to the serial port, but otherwise should be harmless. Original error message: %s
pt_br: não foi possível reconstruir o arquivo de configuração do grub2 (%s). Isso pode significar que a saída do grub não será enviada para a porta serial, mas, fora isso, não deve causar problemas. Mensagem de erro original: %s

source: could not refresh libvirt pool ‘%s’: %s
pt_br: não foi possível atualizar o pool libvirt ‘%s’: %s

source: could not remove grub2 serial console (ignored)
pt_br: não foi possível remover o console serial do grub2 (ignorado)

source: decode_utf16le: Windows UTF16-LE string contains non-7-bit characters. This is a bug in %s, please report it.
pt_br: decode_utf16le: A string UTF16-LE do Windows contém caracteres que não são de 7 bits. Isso é um bug em %s, por favor, reporte-o.

source: decode_utf16le: Windows string does not appear to be in UTF16-LE encoding. This could be a bug in %s.
pt_br: decode_utf16le: A string do Windows não parece estar codificada em UTF16-LE. Isso pode ser um bug em %s.

source: didn't find grub entry for kernel %s
pt_br: não foi encontrada entrada do grub para o kernel %s

source: disks on the command line have mixed formats
pt_br: discos na linha de comando têm formatos mistos

source: display <graphics type='%s'> in the input libvirt XML was ignored
pt_br: a exibição de <graphics type='%s'> no XML de entrada do libvirt foi ignorada

source: don’t know how to convert UEFI guests for architecture %s
pt_br: não sei como converter convidados UEFI para a arquitetura %s

source: don’t know how to find file owner using %s
pt_br: não sei como encontrar o proprietário do arquivo usando %s

source: don’t know how to get list of files from package using %s
pt_br: não sei como obter a lista de arquivos de um pacote usando %s

source: downloading %s
pt_br: baixando %s

source: duplicate --mac parameter. Duplicate mappings specified for MAC address %s.
pt_br: parâmetro --mac duplicado. Mapeamentos duplicados especificados para o endereço MAC %s.

source: duplicate -b/--bridge parameter. Duplicate mappings specified for bridge %s.
pt_br: parâmetro -b/--bridge duplicado. Mapeamentos duplicados especificados para a ponte %s.

source: duplicate -b/--bridge parameter. Only one default mapping is allowed.
pt_br: parâmetro -b/--bridge duplicado. Apenas um mapeamento padrão é permitido.

source: duplicate -n/--network parameter. Duplicate mappings specified for network %s.
pt_br: parâmetro -n/--network duplicado. Mapeamentos duplicados especificados para a rede %s.

source: duplicate -n/--network parameter. Only one default mapping is allowed.
pt_br: parâmetro -n/--network duplicado. Apenas um mapeamento padrão é permitido.

source: error parsing disk fileRef
pt_br: erro ao analisar fileRef do disco

source: error uncompressing %s, see earlier error messages
pt_br: erro ao descompactar %s, veja as mensagens de erro anteriores

source: error unpacking %s, see earlier error messages
pt_br: erro ao desempacotar %s, veja as mensagens de erro anteriores

source: exception: %s
pt_br: exceção: %s

source: exited with error %d
pt_br: saiu com erro %d

source: exited with non-zero error code %d
pt_br: saiu com código de erro não-zero %d

source: expected >= 1 disk name on the command line
pt_br: esperava nome de disco >= 1 na linha de comando

source: expecting XML expression to return an integer (expression: %s, matching string: %s)
pt_br: espera-se que a expressão XML retorne um número inteiro (expressão: %s, string correspondente: %s)

source: external command
pt_br: comando externo

source: failed server prechecks, see earlier errors
pt_br: falha nas prechecks do servidor; consulte os erros anteriores

source: failed to create virtual machine, see earlier errors
pt_br: falha ao criar a máquina virtual; consulte os erros anteriores

source: failed to finalize the transfers, see earlier errors
pt_br: falha ao finalizar as transferências; consulte os erros anteriores

source: failed to find grub2-mkconfig binary (but Grub2 was detected on guest)
pt_br: falha ao encontrar o binário grub2-mkconfig (mas o Grub2 foi detectado no convidado)

source: failed to parse line returned by tar: %S
pt_br: falha ao analisar a linha retornada por tar: %S

source: failed to start transfer, see earlier errors
pt_br: falha ao iniciar a transferência; consulte os erros anteriores

source: failed vmchecks, see earlier errors
pt_br: falha nas vmchecks; consulte os erros anteriores

source: failure: %s
pt_br: falha: %s

source: file ‘%s’ not found in the ova
pt_br: arquivo ‘%s’ não encontrado no ova

source: firstboot: unknown version for old firstboot.service file %s (md5=%s), it will not be removed
pt_br: firstboot: versão desconhecida para o arquivo antigo firstboot.service %s (md5=%s), ele não será removido

source: generated by %s %s
pt_br: gerada por %s %s

source: get_osinfo_id: unknown guest operating system: %s
pt_br: get_osinfo_id: sistema operacional convidado desconhecido: %s

source: glance: glance client is not installed or set up correctly. You may need to set environment variables or source a script to enable authentication. See preceding messages for details.
pt_br: glance: o cliente glance não está instalado ou configurado corretamente. Pode ser necessário definir variáveis de ambiente ou executar um script para habilitar a autenticação. Consulte as mensagens anteriores para obter detalhes.

source: glance: image upload to glance failed, see earlier errors
pt_br: glance: falha ao carregar a imagem para o glance, veja os erros anteriores

source: guest type %s is not supported
pt_br: O tipo de convidado %s não é suportado

source: guest type %s/%s is not supported
pt_br: O tipo de convidado %s/%s não é suportado

source: host (%s/%s) and guest (%s/%s) are not compatible, so you cannot use command line options that involve running commands in the guest. Use --firstboot scripts instead.
pt_br: O host (%s/%s) e o convidado (%s/%s) não são compatíveis, portanto, você não pode usar opções de linha de comando que envolvam a execução de comandos no convidado. Use scripts --firstboot em vez disso.

source: hostname could not be set for this type of guest
pt_br: nome do host não pôde ser definido para este tipo de convidado

source: ignoring kernel %s in bootloader, as it does not exist.
pt_br: ignorando o kernet %s no carregador de inicialização, pois ele não existe.

source: image directory (%s) does not exist or is not a directory
pt_br: o diretório de imagem (%s) não existe ou não é um diretório

source: in the libvirt XML metadata, <domain type='...'> is missing or empty
pt_br: nos metadados do XML do libvirt, <domain type='...'> está em falta ou vazio

source: in the libvirt XML metadata, <name> is missing or empty
pt_br: nos metadados do XML do libvirt, <name> está em falta ou vazio

source: in-place mode does not work with HTTP source
pt_br: o modo in-place não funciona com a fonte HTTP

source: in-place mode does not work with VDDK source
pt_br: o modo in-place não funciona com a fonte VDDK

source: in-place mode does not work with VMX source
pt_br: o modo in-place não funciona com a fonte VMX

source: in-place mode does not work with Xen over SSH source
pt_br: o modo in-place não funciona com a fonte Xen por SSH

source: incorrect number of '-oo disk' parameters. This guest has %d disks, but the parameter was used %d times.
pt_br: número incorreto de parâmetros de '-oo disk'. Este convidado tem %d discos, mas o parâmetro foi usado %d vezes.

source: input from xen over ssh does not support disks stored on remote block devices. See virt-v2v-input-xen(1) section "Xen or ssh conversions from block devices".
pt_br: a entrada de xen por ssh não suporta discos armazenados em dispositivos de bloco remotos. Consulte a seção "Conversões de Xen ou SSH de dispositivos de bloco" em virt-v2v-input-xen(1).
